#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=5044735467309818587]
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=1962420004886609534]
proxmox_lxc.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-carina/lxc/2004]
proxmox_lxc.k3s-lb-1: Refreshing state... [id=milky-capella/lxc/12001]
proxmox_lxc.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-polaris/lxc/2007]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-capella/qemu/10000]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_lxc.k3s-lb-3: Refreshing state... [id=milky-polaris/lxc/12003]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_lxc.k3s-lb-2: Refreshing state... [id=milky-carina/lxc/12002]
proxmox_lxc.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/lxc/2003]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-capella/qemu/11000]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "5044735467309818587" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2025-01-11T12:32:30Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "1962420004886609534" -> (known after apply)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-1" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-capella/lxc/2003"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/2004"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/2007"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-1 must be replaced
-/+ resource "proxmox_lxc" "k3s-lb-1" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-capella/lxc/12001" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + ssh_public_keys      = <<-EOT # forces replacement
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:E2:D6:17" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:20:7B:E6" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-12001-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_lxc.k3s-lb-2 must be replaced
-/+ resource "proxmox_lxc" "k3s-lb-2" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-carina/lxc/12002" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + ssh_public_keys      = <<-EOT # forces replacement
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:8A:9D:17" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:BE:56:8C" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-12002-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_lxc.k3s-lb-3 must be replaced
-/+ resource "proxmox_lxc" "k3s-lb-3" {
      - bwlimit              = 0 -> null
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
      - force                = false -> null
      ~ id                   = "milky-polaris/lxc/12003" -> (known after apply)
      - ignore_unpack_errors = false -> null
      ~ ostype               = "ubuntu" -> (known after apply)
      - restore              = false -> null
      + ssh_public_keys      = <<-EOT # forces replacement
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tags                 = (known after apply)
      - template             = false -> null
      - unique               = false -> null
      ~ unprivileged         = true -> false
      ~ unused               = [] -> (known after apply)
        # (24 unchanged attributes hidden)

      ~ network {
          ~ hwaddr   = "BC:24:11:46:B0:9B" -> (known after apply)
          ~ id       = 0 -> (known after apply)
          - mtu      = 0 -> null
            name     = "eth0"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ hwaddr   = "BC:24:11:49:BB:4D" -> (known after apply)
          ~ id       = 1 -> (known after apply)
            name     = "eth1"
          - rate     = 0 -> null
          ~ tag      = 0 -> (known after apply)
          + trunks   = (known after apply)
          ~ type     = "veth" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ rootfs {
          - acl       = false -> null
          - quota     = false -> null
          - replicate = false -> null
          - ro        = false -> null
          - shared    = false -> null
          ~ volume    = "local-lvm:vm-12003-disk-0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (71 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (71 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + bootdisk               = "scsi0"
        id                     = "milky-capella/qemu/10000"
        name                   = "solufit-k3s-controller-1"
        tags                   = null
        # (70 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
        tags                   = null
        # (70 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
        tags                   = null
        # (70 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + bootdisk               = "scsi0"
        id                     = "milky-capella/qemu/11000"
        name                   = "solufit-k3s-worker-1"
        tags                   = null
        # (70 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + bootdisk               = "scsi0"
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
        tags                   = null
        # (70 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
        tags                   = null
        # (70 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 11 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*